Revit 2026 API

# gbXMLBuildingOperatingSchedule Enumeration

---

Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum gbXMLBuildingOperatingSchedule
```
```vb
Public Enumeration gbXMLBuildingOperatingSchedule
```
```cpp
public enum class gbXMLBuildingOperatingSchedule
```
```fsharp
type gbXMLBuildingOperatingSchedule
```

| Member name | Value | Description |
| --- | --- | --- |
| DefaultOperatingSchedule | 0 |  |
| KindergartenThruTwelveGradeSchool | 7 |  |
| NoOfOperatingScheduleEnums | 11 |  |
| TheaterPerformingArts | 9 |  |
| TwelveHourFiveDayFacility | 6 |  |
| TwelveHourSevenDayFacility | 4 |  |
| TwelveHourSixDayFacility | 5 |  |
| TwentyFourHourHourFiveDayFacility | 3 |  |
| TwentyFourHourHourSixDayFacility | 2 |  |
| TwentyFourHourSevenDayFacility | 1 |  |
| Worship | 10 |  |
| YearRoundSchool | 8 |  |

This enumeration corresponds to the buildingType attribute in gbXML and is used to specify the building operating schedule.

#### Reference

Autodesk.Revit.DB.Analysis Namespace